#include "./Module/Main/Data/inc/MainData.h"


/*------------------------------------------------------------
@作用：主数据类默认方法
@包含：MainData()、~MainData()
--------------------------------------------------------------*/

// 主数据类构造方法
MainData::MainData()
{

}

// 主数据类析构方法
MainData::~MainData()
{
    // pass
}

/*------------------------------------------------------------
@作用：主数据类自定义方法
@包含：mInitMainData()
--------------------------------------------------------------*/

// 初始化主数据
void MainData::mInitMainData()
{
    // pass
}
