#include "./Model/Main/inc/MainData.h"


/*------------------------------------------------------------
@：作用：主数据类默认方法
@：包含：MainData()、~MainData()
--------------------------------------------------------------*/

// 主数据类构造方法
MainData::MainData()
{
    this->ui = new Ui::MainView;    // 创建主视图UI对象
}

// 主数据类析构方法
MainData::~MainData()
{

}

/*------------------------------------------------------------
@：作用：主视图自定义方法
@：包含：fAddStyleAndUi()、fAddSelectColorBox()
--------------------------------------------------------------*/

// 初始化主数据
void MainData::mInitMainData()
{
    // pass
}
