#include "./Model/Login/inc/LoginData.h"


/*------------------------------------------------------------
@作用：主数据类默认方法
@包含：LoginData()、~LoginData()
--------------------------------------------------------------*/

// 主数据类构造方法
LoginData::LoginData()
{
    this->ui = new Ui::LoginView;    // 创建主视图UI对象
}

// 主数据类析构方法
LoginData::~LoginData()
{
    // pass
}

/*------------------------------------------------------------
@作用：主数据类自定义方法
@包含：mInitLoginData()
--------------------------------------------------------------*/

// 初始化主数据
void LoginData::mInitData()
{
    // pass
}

